{
    "---- Begin generic ----": "---- Begin generic ----",
    "Your language has been set!": "Tu idioma ha sido configurado",
    "Setup Required": "Requiere configuración",
    "Please run /setup": "Ejecutar /setup",
    "There was an error! Error code: 0x01": "¡Hubo un error! Código de error: 0x01",
    "Error!": "¡error!",
    "Invite Shift Logger!": "Invitar a Shift Logger",
    "Invite Link": "Enlace de invitación",
    "---| Help & Info |---": "--- | Ayuda e información | ---",
    "Help&Support Server": "Servidor de ayuda y soporte",
    "Made with &love& by HTT5041": "Hecho con &love& por HTT5041",
    "This command lets you set your language that the bot will speak to you in!": "¡Este comando te permite configurar el idioma en el que el bot te hablará!",
    "Use this command to start your shift, you can only have one shift running at a time.": "Use este comando para comenzar su turno, solo puede tener un turno funcionando a la vez.",
    "Use this command to end your shift, this can only be used when a shift is running. It will also tell you how long your shift lasted!": "Use este comando para finalizar su turno, esto solo se puede usar cuando se está ejecutando un turno. ¡También le dirá cuánto duró su turno!",
    "Use this command to see how many total minutes a user has on their time sheet.": "Utilice este comando para ver cuántos minutos totales tiene un usuario en su hoja de tiempo.",
    "This command will generate a leaderboard from the server's stats.": "Este comando generará una tabla de clasificación a partir de las estadísticas del servidor.",
    "This command allows you to see how long your shift has been running without ending it.": "Este comando le permite ver cuánto tiempo ha estado funcionando su turno sin finalizarlo.",
    "If you are looking for admin commands, please type /adminhelp": "Si está buscando comandos de administrador, escriba /adminhelp",
    "You are not authorised to run this command!": "No estás autorizado para ejecutar este comando!",
    "---| Admin Command Help |---": "--- | Ayuda del comando de administración | ---",
    "This command will reset the server configuration, allowing you to use /setup again": "Este comando restablecerá la configuración del servidor, permitiéndole usar /setup nuevamente",
    "This command lets you add credit to a user's timesheet": "Este comando le permite agregar crédito a la hoja de horas de un usuario",
    "This command, believe it or not, does the opposite to /addcredit!": "¡Este comando, lo crea o no, hace lo contrario a /addcredit!",
    "This command will wipe ALL stats in a server, this command is very destructive if used incorrectly, this action is irreversable!": "Este comando borrará TODAS las estadísticas en un servidor, este comando es muy destructivo si se usa incorrectamente, ¡esta acción es irreversible!",
    "This command will end the specified user's shift.": "Este comando finalizará el turno del usuario especificado.",
    "When used it will reset the mentioned users time and delete their stats.": "Cuando se usa, restablecerá el tiempo de los usuarios mencionados y eliminará sus estadísticas.",
    "When used the bot will DM you the latest audit log for your server.": "Cuando se utiliza, el bot le enviará un mensaje de DM con el registro de auditoría más reciente de su servidor.",
    "Time must be a positive value!": "¡El tiempo debe ser un valor positivo!",
    "Success!": "¡Éxito!",
    "Error. The user you are trying to add credit to likely doesn't have a timesheet!": "Error. ¡Es probable que el usuario al que intentas agregar crédito no tenga una hoja de tiempo!",
    "Error. The user you are trying to remove credit from likely doesn't have a timesheet!": "Error. ¡El usuario al que está intentando quitarle crédito probablemente no tenga una hoja de horas trabajadas!",
    "Are you sure you want to wipe ALL server stats?": "¿Estás seguro de que quieres borrar TODAS las estadísticas del servidor?",
    "Error. The specified user doesn't have a timesheet!": "Error. ¡El usuario especificado no tiene una hoja de tiempo!",
    "Setup Succcessful!": "Configurar exitoso!",
    "Hey, you have successfully set up your server! You can use /help and /adminhelp to view all of the commands we offer. Also please join our [**Help&Support Server**](https://discord.gg/PFGgfwvfdf) so you can get any help you might need! Thanks :)\n\nAlso, I have created 2 new roles: &role1& and &role2&, &role1& will be automatically given to a user when they start a shift. &role2& is what you should give to users that you trust with the admin commands!": "¡Oye, has configurado correctamente tu servidor! Puede usar /help y /adminhelp para ver todos los comandos que ofrecemos. Además, únase a nuestro [**Help&Support Server**](https://discord.gg/PFGgfwvfdf) para que pueda obtener la ayuda que pueda necesitar. Gracias :)\n\nAdemás, he creado 2 roles nuevos: &role1& y &role2&, &role1& se asignará automáticamente a un usuario cuando comience un turno. ¡&role2& es lo que debe dar a los usuarios en los que confía con los comandos de administración!",
    "This server is already setup! If you are trying to change the setup please reset the server first with /reset.": "¡Este servidor ya está configurado! Si está intentando cambiar la configuración, primero reinicie el servidor con /reset.",
    "Reset Successful": "Restablecer exitoso",
    "You have reset your server's config, no user stats were wiped.": "Ha restablecido la configuración de su servidor, no se borraron las estadísticas del usuario.",
    "Error, your server is not setup": "Error, su servidor no está configurado",
    "Your shift has started!": "¡Tu turno ha comenzado!",
    "There was an error! Error code: 0x02": "¡Hubo un error! Código de error: 0x02",
    "The user specified does not have an active shift!":"¡El usuario especificado no tiene un turno activo!",
    "You cannot start a shift because you already have one running!": "¡No puede comenzar un turno porque ya tiene uno en funcionamiento!",
    "You cannot end your shift because you don't have one running!": "¡No puede terminar su turno porque no tiene uno en ejecución!",
    "Unfortunately, you cannot generate a fresh leaderboard for your server yet, please wait!\n\n Here is the latest leaderboard:": "Lamentablemente, aún no puede generar una nueva tabla de clasificación para su servidor, ¡espere! \n\n Aquí está la tabla de clasificación más reciente:",
    "---- Begin complex ----": "---- Begin complex ----",
    "Successfully added &time& minutes to user &user&!": "¡Se agregaron con éxito &time& minutos al usuario &user&!",
    "Successfully removed &time& minutes from user &user&!": "Eliminado con éxito &time& minutos de usuario &user&!",
    "Successfully wiped &user&'s stats.": "Se borraron con éxito las estadísticas de &user&.",
    "Your shift has ended, it lasted &time& minutes!": "Tu turno ha terminado, ¡duró &time& minutos!",
    "&user&'s shift has been running for &time& minutes!": "¡El turno de &user& ha estado funcionando durante &time& minutos!",
    "&user& doesn't have a shift running, so you can't get an update!": "&user& no tiene un turno en ejecución, por lo que no puede obtener una actualización.",
    "The user &user& has &time& minutes logged! (&time_hrs& hours)": "¡El usuario &user& tiene &time& minutos registrados! (&time_hrs& horas)",
    "The user &user& has never finished a shift!": "El usuario &user& nunca ha terminado un turno!"
}